; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	thermograph0 - mode
	spectrograph3 - mode
	image1 - mode
	infrared2 - mode
	Star0 - direction
	Star2 - direction
	Star1 - direction
	Phenomenon3 - direction
	Phenomenon4 - direction
	Planet5 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Planet14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Star17 - direction
	Phenomenon18 - direction
	Phenomenon19 - direction
)
(:init
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star1)
	(supports instrument1 image1)
	(supports instrument1 infrared2)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 Star2)
	(supports instrument2 spectrograph3)
	(supports instrument2 image1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument3 infrared2)
	(supports instrument3 image1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star2)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon9)
	(supports instrument4 image1)
	(supports instrument4 infrared2)
	(calibration_target instrument4 Star0)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
	(supports instrument5 infrared2)
	(supports instrument5 image1)
	(supports instrument5 spectrograph3)
	(calibration_target instrument5 Star0)
	(supports instrument6 image1)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 Star2)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star17)
	(supports instrument7 infrared2)
	(calibration_target instrument7 Star2)
	(supports instrument8 infrared2)
	(supports instrument8 thermograph0)
	(supports instrument8 spectrograph3)
	(calibration_target instrument8 Star1)
	(supports instrument9 infrared2)
	(supports instrument9 image1)
	(supports instrument9 spectrograph3)
	(calibration_target instrument9 Star1)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star1)
)
(:goal (and
	(pointing satellite0 Phenomenon18)
	(pointing satellite1 Star1)
	(pointing satellite3 Planet11)
	(have_image Phenomenon3 thermograph0)
	(have_image Phenomenon4 spectrograph3)
	(have_image Planet5 image1)
	(have_image Planet6 infrared2)
	(have_image Star7 spectrograph3)
	(have_image Phenomenon9 infrared2)
	(have_image Star10 infrared2)
	(have_image Planet11 infrared2)
	(have_image Phenomenon12 thermograph0)
	(have_image Planet13 image1)
	(have_image Planet14 thermograph0)
	(have_image Planet15 thermograph0)
	(have_image Phenomenon16 spectrograph3)
	(have_image Star17 image1)
	(have_image Phenomenon18 spectrograph3)
	(have_image Phenomenon19 image1)
))

)

; plan
1. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 0 of 19
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 19
3. (calibrate satellite0 instrument2 star1)
   added: (calibrated instrument2)
   goals met: 0 of 19
4. (turn_to satellite4 phenomenon9 star1)
   deleted: (pointing satellite4 star1)
   added: (pointing satellite4 phenomenon9)
   goals met: 0 of 19
5. (turn_to satellite4 star2 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 star2)
   goals met: 0 of 19
6. (calibrate satellite4 instrument7 star2)
   added: (calibrated instrument7)
   goals met: 0 of 19
7. (turn_to satellite4 phenomenon9 star2)
   deleted: (pointing satellite4 star2)
   added: (pointing satellite4 phenomenon9)
   goals met: 0 of 19
8. (take_image satellite4 phenomenon9 instrument7 infrared2)
   added: (have_image phenomenon9 infrared2)
   goals met: 1 of 19
9. (turn_to satellite4 planet11 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 planet11)
   goals met: 1 of 19
10. (take_image satellite4 planet11 instrument7 infrared2)
   added: (have_image planet11 infrared2)
   goals met: 2 of 19
11. (turn_to satellite4 planet6 planet11)
   deleted: (pointing satellite4 planet11)
   added: (pointing satellite4 planet6)
   goals met: 2 of 19
12. (take_image satellite4 planet6 instrument7 infrared2)
   added: (have_image planet6 infrared2)
   goals met: 3 of 19
13. (turn_to satellite4 star10 planet6)
   deleted: (pointing satellite4 planet6)
   added: (pointing satellite4 star10)
   goals met: 3 of 19
14. (take_image satellite4 star10 instrument7 infrared2)
   added: (have_image star10 infrared2)
   goals met: 4 of 19
15. (turn_to satellite3 planet11 star17)
   deleted: (pointing satellite3 star17)
   added: (pointing satellite3 planet11)
   goals met: 5 of 19
16. (turn_to satellite1 star1 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 star1)
   goals met: 6 of 19
17. (turn_to satellite0 phenomenon12 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon12)
   goals met: 6 of 19
18. (take_image satellite0 phenomenon12 instrument2 thermograph0)
   added: (have_image phenomenon12 thermograph0)
   goals met: 7 of 19
19. (turn_to satellite0 phenomenon16 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon16)
   goals met: 7 of 19
20. (take_image satellite0 phenomenon16 instrument2 spectrograph3)
   added: (have_image phenomenon16 spectrograph3)
   goals met: 8 of 19
21. (turn_to satellite0 phenomenon18 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon18)
   goals met: 9 of 19
22. (take_image satellite0 phenomenon18 instrument2 spectrograph3)
   added: (have_image phenomenon18 spectrograph3)
   goals met: 10 of 19
23. (turn_to satellite0 phenomenon19 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 phenomenon19)
   goals met: 9 of 19
24. (take_image satellite0 phenomenon19 instrument2 image1)
   added: (have_image phenomenon19 image1)
   goals met: 10 of 19
25. (turn_to satellite0 phenomenon18 phenomenon19)
   deleted: (pointing satellite0 phenomenon19)
   added: (pointing satellite0 phenomenon18)
   goals met: 11 of 19
26. (turn_to satellite0 phenomenon3 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 phenomenon3)
   goals met: 10 of 19
27. (take_image satellite0 phenomenon3 instrument2 thermograph0)
   added: (have_image phenomenon3 thermograph0)
   goals met: 11 of 19
28. (turn_to satellite0 phenomenon18 phenomenon3)
   deleted: (pointing satellite0 phenomenon3)
   added: (pointing satellite0 phenomenon18)
   goals met: 12 of 19
29. (turn_to satellite0 phenomenon4 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 phenomenon4)
   goals met: 11 of 19
30. (take_image satellite0 phenomenon4 instrument2 spectrograph3)
   added: (have_image phenomenon4 spectrograph3)
   goals met: 12 of 19
31. (turn_to satellite0 phenomenon18 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 phenomenon18)
   goals met: 13 of 19
32. (turn_to satellite0 planet13 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 planet13)
   goals met: 12 of 19
33. (take_image satellite0 planet13 instrument2 image1)
   added: (have_image planet13 image1)
   goals met: 13 of 19
34. (turn_to satellite0 phenomenon18 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 phenomenon18)
   goals met: 14 of 19
35. (turn_to satellite0 planet14 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 planet14)
   goals met: 13 of 19
36. (take_image satellite0 planet14 instrument2 thermograph0)
   added: (have_image planet14 thermograph0)
   goals met: 14 of 19
37. (turn_to satellite0 phenomenon18 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 phenomenon18)
   goals met: 15 of 19
38. (turn_to satellite0 planet15 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 planet15)
   goals met: 14 of 19
39. (take_image satellite0 planet15 instrument2 thermograph0)
   added: (have_image planet15 thermograph0)
   goals met: 15 of 19
40. (turn_to satellite0 phenomenon18 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 phenomenon18)
   goals met: 16 of 19
41. (turn_to satellite0 planet5 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 planet5)
   goals met: 15 of 19
42. (take_image satellite0 planet5 instrument2 image1)
   added: (have_image planet5 image1)
   goals met: 16 of 19
43. (turn_to satellite0 phenomenon18 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon18)
   goals met: 17 of 19
44. (turn_to satellite0 star17 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 star17)
   goals met: 16 of 19
45. (take_image satellite0 star17 instrument2 image1)
   added: (have_image star17 image1)
   goals met: 17 of 19
46. (turn_to satellite0 phenomenon18 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 phenomenon18)
   goals met: 18 of 19
47. (turn_to satellite0 star7 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 star7)
   goals met: 17 of 19
48. (take_image satellite0 star7 instrument2 spectrograph3)
   added: (have_image star7 spectrograph3)
   goals met: 18 of 19
49. (turn_to satellite0 phenomenon18 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon18)
   goals met: 19 of 19
